app/Models/UsuariosModel.php

INSERT INTO `usuarios` (`nombre`, `apellidos`, `email`, `password`) VALUES ('Valeria', 'flores', 'vale1@gmail.com', '123456')
---
    public function add($dato){
    	return $this->save($dato);